backend: tensorflow
class_name: Model
config:
  input_layers:
  - [input_2, 0, 0]
  layers:
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 94, 93, 1]
      dtype: float32
      name: input_2
      sparse: false
    inbound_nodes: []
    name: input_2
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: &id002 !!python/tuple [1, 1]
      filters: 16
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 4]
      name: conv2d_8
      padding: same
      strides: &id003 !!python/tuple [1, 1]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - input_2
        - 0
        - 0
        - {}
    name: conv2d_8
  - class_name: MaxPooling2D
    config:
      data_format: channels_last
      name: max_pooling2d_4
      padding: same
      pool_size: &id001 !!python/tuple [2, 2]
      strides: *id001
      trainable: true
    inbound_nodes:
    - - - conv2d_8
        - 0
        - 0
        - {}
    name: max_pooling2d_4
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id002
      filters: 8
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: conv2d_9
      padding: same
      strides: *id003
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - max_pooling2d_4
        - 0
        - 0
        - {}
    name: conv2d_9
  - class_name: MaxPooling2D
    config:
      data_format: channels_last
      name: max_pooling2d_5
      padding: same
      pool_size: &id004 !!python/tuple [2, 2]
      strides: *id004
      trainable: true
    inbound_nodes:
    - - - conv2d_9
        - 0
        - 0
        - {}
    name: max_pooling2d_5
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id002
      filters: 8
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: conv2d_10
      padding: same
      strides: *id003
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - max_pooling2d_5
        - 0
        - 0
        - {}
    name: conv2d_10
  - class_name: MaxPooling2D
    config:
      data_format: channels_last
      name: max_pooling2d_6
      padding: same
      pool_size: &id005 !!python/tuple [2, 2]
      strides: *id005
      trainable: true
    inbound_nodes:
    - - - conv2d_10
        - 0
        - 0
        - {}
    name: max_pooling2d_6
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id002
      filters: 8
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: conv2d_11
      padding: same
      strides: *id003
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - max_pooling2d_6
        - 0
        - 0
        - {}
    name: conv2d_11
  - class_name: UpSampling2D
    config:
      data_format: channels_last
      name: up_sampling2d_4
      size: !!python/tuple [2, 2]
      trainable: true
    inbound_nodes:
    - - - conv2d_11
        - 0
        - 0
        - {}
    name: up_sampling2d_4
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id002
      filters: 8
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: conv2d_12
      padding: same
      strides: *id003
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - up_sampling2d_4
        - 0
        - 0
        - {}
    name: conv2d_12
  - class_name: UpSampling2D
    config:
      data_format: channels_last
      name: up_sampling2d_5
      size: !!python/tuple [2, 2]
      trainable: true
    inbound_nodes:
    - - - conv2d_12
        - 0
        - 0
        - {}
    name: up_sampling2d_5
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id002
      filters: 16
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: conv2d_13
      padding: same
      strides: *id003
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - up_sampling2d_5
        - 0
        - 0
        - {}
    name: conv2d_13
  - class_name: UpSampling2D
    config:
      data_format: channels_last
      name: up_sampling2d_6
      size: !!python/tuple [2, 2]
      trainable: true
    inbound_nodes:
    - - - conv2d_13
        - 0
        - 0
        - {}
    name: up_sampling2d_6
  - class_name: Conv2D
    config:
      activation: sigmoid
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id002
      filters: 1
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 4]
      name: conv2d_14
      padding: valid
      strides: *id003
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - up_sampling2d_6
        - 0
        - 0
        - {}
    name: conv2d_14
  name: model_3
  output_layers:
  - [conv2d_14, 0, 0]
keras_version: 2.0.3
